Model Version: v3
Batch Size: 32
Epochs: 1000
Early Stop Patience: 10
Image Dimensions: 160h, 160w, 1c
Model Version: v3
Batch Size: 32
Epochs: 1000
Early Stop Patience: 10
Image Dimensions: 160h, 160w, 1c
Model Version: v3
Batch Size: 32
Epochs: 1000
Early Stop Patience: 10
Image Dimensions: 160h, 160w, 1c
Model Version: v3
Batch Size: 32
Epochs: 1000
Early Stop Patience: 10
Image Dimensions: 160h, 160w, 1c
Model Version: v3
Batch Size: 32
Epochs: 1000
Early Stop Patience: 10
Image Dimensions: 160h, 160w, 1c
Model Version: v3
Batch Size: 32
Epochs: 1000
Early Stop Patience: 10
Image Dimensions: 160h, 160w, 1c
Model Version: v3
Batch Size: 32
Epochs: 1000
Early Stop Patience: 10
Image Dimensions: 160h, 160w, 1c
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 160, 160, 1)  0                                            
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 160, 160, 32) 832         input_1[0][0]                    
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 160, 160, 32) 25632       conv2d_1[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 80, 80, 32)   0           conv2d_2[0][0]                   
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 80, 80, 48)   13872       max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 80, 80, 48)   20784       conv2d_3[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)  (None, 40, 40, 48)   0           conv2d_4[0][0]                   
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 40, 40, 64)   27712       max_pooling2d_2[0][0]            
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 40, 40, 64)   36928       conv2d_5[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_3 (MaxPooling2D)  (None, 20, 20, 64)   0           conv2d_6[0][0]                   
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 20, 20, 96)   55392       max_pooling2d_3[0][0]            
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 20, 20, 128)  110720      conv2d_7[0][0]                   
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 20, 20, 96)   110688      conv2d_8[0][0]                   
__________________________________________________________________________________________________
conv2d_transpose_1 (Conv2DTrans (None, 40, 40, 64)   55360       conv2d_9[0][0]                   
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 40, 40, 128)  0           conv2d_transpose_1[0][0]         
                                                                 conv2d_6[0][0]                   
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 40, 40, 64)   73792       concatenate_1[0][0]              
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 40, 40, 64)   36928       conv2d_10[0][0]                  
__________________________________________________________________________________________________
conv2d_transpose_2 (Conv2DTrans (None, 80, 80, 48)   27696       conv2d_11[0][0]                  
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 80, 80, 96)   0           conv2d_transpose_2[0][0]         
                                                                 conv2d_4[0][0]                   
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (None, 80, 80, 48)   41520       concatenate_2[0][0]              
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (None, 80, 80, 48)   20784       conv2d_12[0][0]                  
__________________________________________________________________________________________________
conv2d_transpose_3 (Conv2DTrans (None, 160, 160, 32) 13856       conv2d_13[0][0]                  
__________________________________________________________________________________________________
concatenate_3 (Concatenate)     (None, 160, 160, 64) 0           conv2d_transpose_3[0][0]         
                                                                 conv2d_2[0][0]                   
__________________________________________________________________________________________________
conv2d_14 (Conv2D)              (None, 160, 160, 32) 18464       concatenate_3[0][0]              
__________________________________________________________________________________________________
conv2d_15 (Conv2D)              (None, 160, 160, 32) 9248        conv2d_14[0][0]                  
__________________________________________________________________________________________________
conv2d_16 (Conv2D)              (None, 160, 160, 32) 9248        conv2d_15[0][0]                  
__________________________________________________________________________________________________
conv2d_17 (Conv2D)              (None, 160, 160, 64) 18496       conv2d_16[0][0]                  
__________________________________________________________________________________________________
conv2d_18 (Conv2D)              (None, 160, 160, 32) 18464       conv2d_17[0][0]                  
__________________________________________________________________________________________________
conv2d_19 (Conv2D)              (None, 160, 160, 1)  33          conv2d_18[0][0]                  
==================================================================================================
Total params: 746,449
Trainable params: 746,449
Non-trainable params: 0
__________________________________________________________________________________________________
