Model Version: v2
Batch Size: 32
Epochs: 1000
Early Stop Patience: 10
Image Dimensions: 160h, 160w, 1c
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 160, 160, 1)       0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 160, 160, 16)      416       
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 160, 160, 16)      6416      
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 80, 80, 16)        0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 80, 80, 32)        12832     
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 80, 80, 32)        25632     
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 40, 40, 32)        0         
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 40, 40, 48)        13872     
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 40, 40, 48)        20784     
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 20, 20, 48)        0         
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 20, 20, 64)        76864     
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 20, 20, 128)       73856     
_________________________________________________________________
conv2d_9 (Conv2D)            (None, 20, 20, 64)        204864    
_________________________________________________________________
conv2d_transpose_1 (Conv2DTr (None, 20, 20, 48)        27696     
_________________________________________________________________
conv2d_transpose_2 (Conv2DTr (None, 20, 20, 48)        20784     
_________________________________________________________________
up_sampling2d_1 (UpSampling2 (None, 40, 40, 48)        0         
_________________________________________________________________
conv2d_transpose_3 (Conv2DTr (None, 40, 40, 32)        38432     
_________________________________________________________________
conv2d_transpose_4 (Conv2DTr (None, 40, 40, 32)        25632     
_________________________________________________________________
up_sampling2d_2 (UpSampling2 (None, 80, 80, 32)        0         
_________________________________________________________________
conv2d_transpose_5 (Conv2DTr (None, 80, 80, 16)        12816     
_________________________________________________________________
conv2d_transpose_6 (Conv2DTr (None, 80, 80, 16)        6416      
_________________________________________________________________
up_sampling2d_3 (UpSampling2 (None, 160, 160, 16)      0         
_________________________________________________________________
conv2d_transpose_7 (Conv2DTr (None, 160, 160, 16)      6416      
_________________________________________________________________
conv2d_transpose_8 (Conv2DTr (None, 160, 160, 8)       1160      
_________________________________________________________________
conv2d_10 (Conv2D)           (None, 160, 160, 1)       9         
=================================================================
Total params: 574,897
Trainable params: 574,897
Non-trainable params: 0
_________________________________________________________________
